app/controllers/api/v1/comments_controller.rb

INSERT INTO `comments` (`body`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('Yay!', 267, 251, '2021-06-03 15:23:46.826160', '2021-06-03 15:23:46.826160')
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_api_v1_user.id
    if @comment.save

UPDATE `comments` SET `comments`.`body` = 'Yay!', `comments`.`updated_at` = '2021-06-03 15:24:43.113059' WHERE `comments`.`id` = 41
---
  def update
    if @comment.update(comment_params)

DELETE FROM `comments` WHERE `comments`.`id` = 23
---
  def destroy
    if @comment.destroy

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 229 LIMIT 1
---
  def set_post
    @post = Post.find(params[:post_id])

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 229 AND `comments`.`id` = 23 LIMIT 1
---
  def set_comment
    @comment = @post.comments.find(params[:id])