app/controllers/api/v1/posts_controller.rb

INSERT INTO `posts` (`body`, `user_id`, `created_at`, `updated_at`) VALUES ('Yay!', 51, '2021-06-03 13:57:31.802735', '2021-06-03 13:57:31.802735')
---
  def create
    @post = Post.new(post_params)
    @post.user = current_api_v1_user
    if @post.save

UPDATE `posts` SET `posts`.`body` = 'Yay!', `posts`.`updated_at` = '2021-06-03 14:14:33.358027' WHERE `posts`.`id` = 93
---
  def update
    if @post.update(post_params)

DELETE FROM `posts` WHERE `posts`.`id` = 121
---
  def destroy
    if @post.destroy