app/controllers/api/v1/reactions_controller.rb

INSERT INTO `reactions` (`emote`, `user_id`, `comment_id`, `created_at`, `updated_at`) VALUES (0, 467, 109, '2021-06-03 15:56:49.984219', '2021-06-03 15:56:49.984219')
---
  def create
    @reaction = @comment.reactions.build(reaction_params)
    @reaction.user_id = current_api_v1_user.id
    if @reaction.save

SELECT `reactions`.* FROM `reactions` WHERE `reactions`.`comment_id` = 113 AND `reactions`.`id` = 31 LIMIT 1
DELETE FROM `reactions` WHERE `reactions`.`id` = 31
---
  def destroy
    @reaction = @comment.reactions.find(params[:id])
    if @reaction.destroy

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 113 LIMIT 1
---
  def set_comment
    @comment = Comment.find(params[:comment_id])