app/controllers/comments_controller.rb

  def set_post
    @post = Post.find(params[:post_id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def set_comment
    @comment = @post.comments.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1