app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def posts
    user = User.find(params[:id])